#+TITLE: Ghost Nodes: The Complete Reference
#+AUTHOR: ii.coop
#+DATE: 2026-01-29
#+DESCRIPTION: A self-documenting guide to every Ghost Lexical node type with org-mode source examples

#+GHOST_SLUG: ghost-nodes
#+GHOST_TYPE: post
#+GHOST_STATUS: draft
#+GHOST_VISIBILITY: public
#+GHOST_TAGS: ox-ghost, org-mode, ghost, reference, documentation
#+GHOST_EXCERPT: A self-documenting guide to every Ghost Lexical node type with org-mode source examples. See the rendered result, then click to view the org-mode code that produces it.

#+PROPERTY: header-args :eval never-export

** Simple (default)

#+BEGIN_REPL
#+BEGIN_SRC python
2 + 2
#+END_SRC

#+RESULTS:
: 4
#+END_REPL

** Labeled

#+BEGIN_REPL :style labeled :label "Output"
#+BEGIN_SRC python
for i in range(3):
    print(f"Item {i}")
#+END_SRC

#+RESULTS:
: Item 0
: Item 1
: Item 2
#+END_REPL

** Callout

#+BEGIN_REPL :style callout :emoji "✅" :color green
#+BEGIN_SRC bash
echo "Build succeeded!"
#+END_SRC

#+RESULTS:
: Build succeeded!
#+END_REPL

#+BEGIN_TOGGLE :heading "Org Source"
#+BEGIN_SRC org
,#+BEGIN_REPL :style callout :emoji "✅" :color green
,#+BEGIN_SRC python
print("hello")
,#+END_SRC

,#+RESULTS:
: hello
,#+END_REPL
#+END_SRC
#+END_TOGGLE

** Toggle

#+BEGIN_REPL :style toggle :heading "Show implementation"
#+BEGIN_SRC python
def fibonacci(n):
    a, b = 0, 1
    for _ in range(n):
        yield a
        a, b = b, a + b

list(fibonacci(8))
#+END_SRC

#+RESULTS:
: [0, 1, 1, 2, 3, 5, 8, 13]
#+END_REPL

** Aside

#+BEGIN_REPL :style aside
#+BEGIN_SRC python
# Alternative one-liner
fib = lambda n: [0,1,1,2,3,5,8,13,21,34][:n]
fib(8)
#+END_SRC

#+RESULTS:
: [0, 1, 1, 2, 3, 5, 8, 13]
#+END_REPL

